---
kind: other
id: Properties.T:Autodesk.Revit.DB.WallType
source: html/6b3f1f32-725f-0ec8-dcdd-75373654d3a2.htm
---
# WallType Properties

The id of the assembly instance to which the element belongs.